// Generated by jextract

package com.sernamar.jgit2.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     unsigned int version;
 *     git_remote_callbacks callbacks;
 *     git_proxy_options proxy_opts;
 *     git_remote_redirect_t follow_redirects;
 *     git_strarray custom_headers;
 * }
 * }
 */
public class git_remote_connect_options {

    git_remote_connect_options() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        git2.C_INT.withName("version"),
        MemoryLayout.paddingLayout(4),
        git_remote_callbacks.layout().withName("callbacks"),
        git_proxy_options.layout().withName("proxy_opts"),
        git2.C_INT.withName("follow_redirects"),
        MemoryLayout.paddingLayout(4),
        git_strarray.layout().withName("custom_headers")
    ).withName("$anon$928:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final OfInt version$layout() {
        return version$LAYOUT;
    }

    private static final long version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final long version$offset() {
        return version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static int version(MemorySegment struct) {
        return struct.get(version$LAYOUT, version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static void version(MemorySegment struct, int fieldValue) {
        struct.set(version$LAYOUT, version$OFFSET, fieldValue);
    }

    private static final GroupLayout callbacks$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("callbacks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_remote_callbacks callbacks
     * }
     */
    public static final GroupLayout callbacks$layout() {
        return callbacks$LAYOUT;
    }

    private static final long callbacks$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_remote_callbacks callbacks
     * }
     */
    public static final long callbacks$offset() {
        return callbacks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_remote_callbacks callbacks
     * }
     */
    public static MemorySegment callbacks(MemorySegment struct) {
        return struct.asSlice(callbacks$OFFSET, callbacks$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_remote_callbacks callbacks
     * }
     */
    public static void callbacks(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, callbacks$OFFSET, callbacks$LAYOUT.byteSize());
    }

    private static final GroupLayout proxy_opts$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("proxy_opts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_proxy_options proxy_opts
     * }
     */
    public static final GroupLayout proxy_opts$layout() {
        return proxy_opts$LAYOUT;
    }

    private static final long proxy_opts$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_proxy_options proxy_opts
     * }
     */
    public static final long proxy_opts$offset() {
        return proxy_opts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_proxy_options proxy_opts
     * }
     */
    public static MemorySegment proxy_opts(MemorySegment struct) {
        return struct.asSlice(proxy_opts$OFFSET, proxy_opts$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_proxy_options proxy_opts
     * }
     */
    public static void proxy_opts(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, proxy_opts$OFFSET, proxy_opts$LAYOUT.byteSize());
    }

    private static final OfInt follow_redirects$LAYOUT = (OfInt)$LAYOUT.select(groupElement("follow_redirects"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_remote_redirect_t follow_redirects
     * }
     */
    public static final OfInt follow_redirects$layout() {
        return follow_redirects$LAYOUT;
    }

    private static final long follow_redirects$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_remote_redirect_t follow_redirects
     * }
     */
    public static final long follow_redirects$offset() {
        return follow_redirects$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_remote_redirect_t follow_redirects
     * }
     */
    public static int follow_redirects(MemorySegment struct) {
        return struct.get(follow_redirects$LAYOUT, follow_redirects$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_remote_redirect_t follow_redirects
     * }
     */
    public static void follow_redirects(MemorySegment struct, int fieldValue) {
        struct.set(follow_redirects$LAYOUT, follow_redirects$OFFSET, fieldValue);
    }

    private static final GroupLayout custom_headers$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("custom_headers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_strarray custom_headers
     * }
     */
    public static final GroupLayout custom_headers$layout() {
        return custom_headers$LAYOUT;
    }

    private static final long custom_headers$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_strarray custom_headers
     * }
     */
    public static final long custom_headers$offset() {
        return custom_headers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_strarray custom_headers
     * }
     */
    public static MemorySegment custom_headers(MemorySegment struct) {
        return struct.asSlice(custom_headers$OFFSET, custom_headers$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_strarray custom_headers
     * }
     */
    public static void custom_headers(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, custom_headers$OFFSET, custom_headers$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

