// Generated by jextract

package com.sernamar.jgit2.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     unsigned int version;
 *     unsigned int allow_empty_commit : 1;
 *     const git_signature *author;
 *     const git_signature *committer;
 *     const char *message_encoding;
 * }
 * }
 */
public class git_commit_create_options {

    git_commit_create_options() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        git2.C_INT.withName("version"),
        MemoryLayout.paddingLayout(4),
        git2.C_POINTER.withName("author"),
        git2.C_POINTER.withName("committer"),
        git2.C_POINTER.withName("message_encoding")
    ).withName("$anon$432:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final OfInt version$layout() {
        return version$LAYOUT;
    }

    private static final long version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final long version$offset() {
        return version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static int version(MemorySegment struct) {
        return struct.get(version$LAYOUT, version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static void version(MemorySegment struct, int fieldValue) {
        struct.set(version$LAYOUT, version$OFFSET, fieldValue);
    }

    private static final AddressLayout author$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("author"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const git_signature *author
     * }
     */
    public static final AddressLayout author$layout() {
        return author$LAYOUT;
    }

    private static final long author$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const git_signature *author
     * }
     */
    public static final long author$offset() {
        return author$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const git_signature *author
     * }
     */
    public static MemorySegment author(MemorySegment struct) {
        return struct.get(author$LAYOUT, author$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const git_signature *author
     * }
     */
    public static void author(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(author$LAYOUT, author$OFFSET, fieldValue);
    }

    private static final AddressLayout committer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("committer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const git_signature *committer
     * }
     */
    public static final AddressLayout committer$layout() {
        return committer$LAYOUT;
    }

    private static final long committer$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const git_signature *committer
     * }
     */
    public static final long committer$offset() {
        return committer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const git_signature *committer
     * }
     */
    public static MemorySegment committer(MemorySegment struct) {
        return struct.get(committer$LAYOUT, committer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const git_signature *committer
     * }
     */
    public static void committer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(committer$LAYOUT, committer$OFFSET, fieldValue);
    }

    private static final AddressLayout message_encoding$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("message_encoding"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *message_encoding
     * }
     */
    public static final AddressLayout message_encoding$layout() {
        return message_encoding$LAYOUT;
    }

    private static final long message_encoding$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *message_encoding
     * }
     */
    public static final long message_encoding$offset() {
        return message_encoding$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *message_encoding
     * }
     */
    public static MemorySegment message_encoding(MemorySegment struct) {
        return struct.get(message_encoding$LAYOUT, message_encoding$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *message_encoding
     * }
     */
    public static void message_encoding(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(message_encoding$LAYOUT, message_encoding$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

