// Generated by jextract

package com.sernamar.jgit2.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int version;
 *     git_remote_callbacks callbacks;
 *     git_fetch_prune_t prune;
 *     unsigned int update_fetchhead;
 *     git_remote_autotag_option_t download_tags;
 *     git_proxy_options proxy_opts;
 *     int depth;
 *     git_remote_redirect_t follow_redirects;
 *     git_strarray custom_headers;
 * }
 * }
 */
public class git_fetch_options {

    git_fetch_options() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        git2.C_INT.withName("version"),
        MemoryLayout.paddingLayout(4),
        git_remote_callbacks.layout().withName("callbacks"),
        git2.C_INT.withName("prune"),
        git2.C_INT.withName("update_fetchhead"),
        git2.C_INT.withName("download_tags"),
        MemoryLayout.paddingLayout(4),
        git_proxy_options.layout().withName("proxy_opts"),
        git2.C_INT.withName("depth"),
        git2.C_INT.withName("follow_redirects"),
        git_strarray.layout().withName("custom_headers")
    ).withName("$anon$776:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int version
     * }
     */
    public static final OfInt version$layout() {
        return version$LAYOUT;
    }

    private static final long version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int version
     * }
     */
    public static final long version$offset() {
        return version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int version
     * }
     */
    public static int version(MemorySegment struct) {
        return struct.get(version$LAYOUT, version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int version
     * }
     */
    public static void version(MemorySegment struct, int fieldValue) {
        struct.set(version$LAYOUT, version$OFFSET, fieldValue);
    }

    private static final GroupLayout callbacks$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("callbacks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_remote_callbacks callbacks
     * }
     */
    public static final GroupLayout callbacks$layout() {
        return callbacks$LAYOUT;
    }

    private static final long callbacks$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_remote_callbacks callbacks
     * }
     */
    public static final long callbacks$offset() {
        return callbacks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_remote_callbacks callbacks
     * }
     */
    public static MemorySegment callbacks(MemorySegment struct) {
        return struct.asSlice(callbacks$OFFSET, callbacks$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_remote_callbacks callbacks
     * }
     */
    public static void callbacks(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, callbacks$OFFSET, callbacks$LAYOUT.byteSize());
    }

    private static final OfInt prune$LAYOUT = (OfInt)$LAYOUT.select(groupElement("prune"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_fetch_prune_t prune
     * }
     */
    public static final OfInt prune$layout() {
        return prune$LAYOUT;
    }

    private static final long prune$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_fetch_prune_t prune
     * }
     */
    public static final long prune$offset() {
        return prune$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_fetch_prune_t prune
     * }
     */
    public static int prune(MemorySegment struct) {
        return struct.get(prune$LAYOUT, prune$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_fetch_prune_t prune
     * }
     */
    public static void prune(MemorySegment struct, int fieldValue) {
        struct.set(prune$LAYOUT, prune$OFFSET, fieldValue);
    }

    private static final OfInt update_fetchhead$LAYOUT = (OfInt)$LAYOUT.select(groupElement("update_fetchhead"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int update_fetchhead
     * }
     */
    public static final OfInt update_fetchhead$layout() {
        return update_fetchhead$LAYOUT;
    }

    private static final long update_fetchhead$OFFSET = 140;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int update_fetchhead
     * }
     */
    public static final long update_fetchhead$offset() {
        return update_fetchhead$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int update_fetchhead
     * }
     */
    public static int update_fetchhead(MemorySegment struct) {
        return struct.get(update_fetchhead$LAYOUT, update_fetchhead$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int update_fetchhead
     * }
     */
    public static void update_fetchhead(MemorySegment struct, int fieldValue) {
        struct.set(update_fetchhead$LAYOUT, update_fetchhead$OFFSET, fieldValue);
    }

    private static final OfInt download_tags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("download_tags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_remote_autotag_option_t download_tags
     * }
     */
    public static final OfInt download_tags$layout() {
        return download_tags$LAYOUT;
    }

    private static final long download_tags$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_remote_autotag_option_t download_tags
     * }
     */
    public static final long download_tags$offset() {
        return download_tags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_remote_autotag_option_t download_tags
     * }
     */
    public static int download_tags(MemorySegment struct) {
        return struct.get(download_tags$LAYOUT, download_tags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_remote_autotag_option_t download_tags
     * }
     */
    public static void download_tags(MemorySegment struct, int fieldValue) {
        struct.set(download_tags$LAYOUT, download_tags$OFFSET, fieldValue);
    }

    private static final GroupLayout proxy_opts$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("proxy_opts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_proxy_options proxy_opts
     * }
     */
    public static final GroupLayout proxy_opts$layout() {
        return proxy_opts$LAYOUT;
    }

    private static final long proxy_opts$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_proxy_options proxy_opts
     * }
     */
    public static final long proxy_opts$offset() {
        return proxy_opts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_proxy_options proxy_opts
     * }
     */
    public static MemorySegment proxy_opts(MemorySegment struct) {
        return struct.asSlice(proxy_opts$OFFSET, proxy_opts$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_proxy_options proxy_opts
     * }
     */
    public static void proxy_opts(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, proxy_opts$OFFSET, proxy_opts$LAYOUT.byteSize());
    }

    private static final OfInt depth$LAYOUT = (OfInt)$LAYOUT.select(groupElement("depth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int depth
     * }
     */
    public static final OfInt depth$layout() {
        return depth$LAYOUT;
    }

    private static final long depth$OFFSET = 192;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int depth
     * }
     */
    public static final long depth$offset() {
        return depth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int depth
     * }
     */
    public static int depth(MemorySegment struct) {
        return struct.get(depth$LAYOUT, depth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int depth
     * }
     */
    public static void depth(MemorySegment struct, int fieldValue) {
        struct.set(depth$LAYOUT, depth$OFFSET, fieldValue);
    }

    private static final OfInt follow_redirects$LAYOUT = (OfInt)$LAYOUT.select(groupElement("follow_redirects"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_remote_redirect_t follow_redirects
     * }
     */
    public static final OfInt follow_redirects$layout() {
        return follow_redirects$LAYOUT;
    }

    private static final long follow_redirects$OFFSET = 196;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_remote_redirect_t follow_redirects
     * }
     */
    public static final long follow_redirects$offset() {
        return follow_redirects$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_remote_redirect_t follow_redirects
     * }
     */
    public static int follow_redirects(MemorySegment struct) {
        return struct.get(follow_redirects$LAYOUT, follow_redirects$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_remote_redirect_t follow_redirects
     * }
     */
    public static void follow_redirects(MemorySegment struct, int fieldValue) {
        struct.set(follow_redirects$LAYOUT, follow_redirects$OFFSET, fieldValue);
    }

    private static final GroupLayout custom_headers$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("custom_headers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_strarray custom_headers
     * }
     */
    public static final GroupLayout custom_headers$layout() {
        return custom_headers$LAYOUT;
    }

    private static final long custom_headers$OFFSET = 200;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_strarray custom_headers
     * }
     */
    public static final long custom_headers$offset() {
        return custom_headers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_strarray custom_headers
     * }
     */
    public static MemorySegment custom_headers(MemorySegment struct) {
        return struct.asSlice(custom_headers$OFFSET, custom_headers$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_strarray custom_headers
     * }
     */
    public static void custom_headers(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, custom_headers$OFFSET, custom_headers$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

