// Generated by jextract

package com.sernamar.jgit2.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     unsigned int version;
 *     git_status_show_t show;
 *     unsigned int flags;
 *     git_strarray pathspec;
 *     git_tree *baseline;
 *     uint16_t rename_threshold;
 * }
 * }
 */
public class git_status_options {

    git_status_options() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        git2.C_INT.withName("version"),
        git2.C_INT.withName("show"),
        git2.C_INT.withName("flags"),
        MemoryLayout.paddingLayout(4),
        git_strarray.layout().withName("pathspec"),
        git2.C_POINTER.withName("baseline"),
        git2.C_SHORT.withName("rename_threshold"),
        MemoryLayout.paddingLayout(6)
    ).withName("$anon$222:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final OfInt version$layout() {
        return version$LAYOUT;
    }

    private static final long version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final long version$offset() {
        return version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static int version(MemorySegment struct) {
        return struct.get(version$LAYOUT, version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static void version(MemorySegment struct, int fieldValue) {
        struct.set(version$LAYOUT, version$OFFSET, fieldValue);
    }

    private static final OfInt show$LAYOUT = (OfInt)$LAYOUT.select(groupElement("show"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_status_show_t show
     * }
     */
    public static final OfInt show$layout() {
        return show$LAYOUT;
    }

    private static final long show$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_status_show_t show
     * }
     */
    public static final long show$offset() {
        return show$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_status_show_t show
     * }
     */
    public static int show(MemorySegment struct) {
        return struct.get(show$LAYOUT, show$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_status_show_t show
     * }
     */
    public static void show(MemorySegment struct, int fieldValue) {
        struct.set(show$LAYOUT, show$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final GroupLayout pathspec$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("pathspec"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_strarray pathspec
     * }
     */
    public static final GroupLayout pathspec$layout() {
        return pathspec$LAYOUT;
    }

    private static final long pathspec$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_strarray pathspec
     * }
     */
    public static final long pathspec$offset() {
        return pathspec$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_strarray pathspec
     * }
     */
    public static MemorySegment pathspec(MemorySegment struct) {
        return struct.asSlice(pathspec$OFFSET, pathspec$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_strarray pathspec
     * }
     */
    public static void pathspec(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, pathspec$OFFSET, pathspec$LAYOUT.byteSize());
    }

    private static final AddressLayout baseline$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("baseline"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_tree *baseline
     * }
     */
    public static final AddressLayout baseline$layout() {
        return baseline$LAYOUT;
    }

    private static final long baseline$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_tree *baseline
     * }
     */
    public static final long baseline$offset() {
        return baseline$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_tree *baseline
     * }
     */
    public static MemorySegment baseline(MemorySegment struct) {
        return struct.get(baseline$LAYOUT, baseline$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_tree *baseline
     * }
     */
    public static void baseline(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(baseline$LAYOUT, baseline$OFFSET, fieldValue);
    }

    private static final OfShort rename_threshold$LAYOUT = (OfShort)$LAYOUT.select(groupElement("rename_threshold"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t rename_threshold
     * }
     */
    public static final OfShort rename_threshold$layout() {
        return rename_threshold$LAYOUT;
    }

    private static final long rename_threshold$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t rename_threshold
     * }
     */
    public static final long rename_threshold$offset() {
        return rename_threshold$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t rename_threshold
     * }
     */
    public static short rename_threshold(MemorySegment struct) {
        return struct.get(rename_threshold$LAYOUT, rename_threshold$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t rename_threshold
     * }
     */
    public static void rename_threshold(MemorySegment struct, short fieldValue) {
        struct.set(rename_threshold$LAYOUT, rename_threshold$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

