// Generated by jextract

package com.sernamar.jgit2.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct git_stash_apply_options {
 *     unsigned int version;
 *     uint32_t flags;
 *     git_checkout_options checkout_options;
 *     git_stash_apply_progress_cb progress_cb;
 *     void *progress_payload;
 * }
 * }
 */
public class git_stash_apply_options {

    git_stash_apply_options() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        git2.C_INT.withName("version"),
        git2.C_INT.withName("flags"),
        git_checkout_options.layout().withName("checkout_options"),
        git2.C_POINTER.withName("progress_cb"),
        git2.C_POINTER.withName("progress_payload")
    ).withName("git_stash_apply_options");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final OfInt version$layout() {
        return version$LAYOUT;
    }

    private static final long version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final long version$offset() {
        return version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static int version(MemorySegment struct) {
        return struct.get(version$LAYOUT, version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static void version(MemorySegment struct, int fieldValue) {
        struct.set(version$LAYOUT, version$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final GroupLayout checkout_options$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("checkout_options"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_checkout_options checkout_options
     * }
     */
    public static final GroupLayout checkout_options$layout() {
        return checkout_options$LAYOUT;
    }

    private static final long checkout_options$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_checkout_options checkout_options
     * }
     */
    public static final long checkout_options$offset() {
        return checkout_options$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_checkout_options checkout_options
     * }
     */
    public static MemorySegment checkout_options(MemorySegment struct) {
        return struct.asSlice(checkout_options$OFFSET, checkout_options$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_checkout_options checkout_options
     * }
     */
    public static void checkout_options(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, checkout_options$OFFSET, checkout_options$LAYOUT.byteSize());
    }

    private static final AddressLayout progress_cb$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("progress_cb"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_stash_apply_progress_cb progress_cb
     * }
     */
    public static final AddressLayout progress_cb$layout() {
        return progress_cb$LAYOUT;
    }

    private static final long progress_cb$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_stash_apply_progress_cb progress_cb
     * }
     */
    public static final long progress_cb$offset() {
        return progress_cb$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_stash_apply_progress_cb progress_cb
     * }
     */
    public static MemorySegment progress_cb(MemorySegment struct) {
        return struct.get(progress_cb$LAYOUT, progress_cb$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_stash_apply_progress_cb progress_cb
     * }
     */
    public static void progress_cb(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(progress_cb$LAYOUT, progress_cb$OFFSET, fieldValue);
    }

    private static final AddressLayout progress_payload$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("progress_payload"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *progress_payload
     * }
     */
    public static final AddressLayout progress_payload$layout() {
        return progress_payload$LAYOUT;
    }

    private static final long progress_payload$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *progress_payload
     * }
     */
    public static final long progress_payload$offset() {
        return progress_payload$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *progress_payload
     * }
     */
    public static MemorySegment progress_payload(MemorySegment struct) {
        return struct.get(progress_payload$LAYOUT, progress_payload$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *progress_payload
     * }
     */
    public static void progress_payload(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(progress_payload$LAYOUT, progress_payload$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

