// Generated by jextract

package com.sernamar.jgit2.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     git_diff_binary_t type;
 *     const char *data;
 *     size_t datalen;
 *     size_t inflatedlen;
 * }
 * }
 */
public class git_diff_binary_file {

    git_diff_binary_file() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        git2.C_INT.withName("type"),
        MemoryLayout.paddingLayout(4),
        git2.C_POINTER.withName("data"),
        git2.C_LONG.withName("datalen"),
        git2.C_LONG.withName("inflatedlen")
    ).withName("$anon$530:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_diff_binary_t type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_diff_binary_t type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_diff_binary_t type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_diff_binary_t type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final AddressLayout data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *data
     * }
     */
    public static final AddressLayout data$layout() {
        return data$LAYOUT;
    }

    private static final long data$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *data
     * }
     */
    public static final long data$offset() {
        return data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *data
     * }
     */
    public static MemorySegment data(MemorySegment struct) {
        return struct.get(data$LAYOUT, data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *data
     * }
     */
    public static void data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(data$LAYOUT, data$OFFSET, fieldValue);
    }

    private static final OfLong datalen$LAYOUT = (OfLong)$LAYOUT.select(groupElement("datalen"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t datalen
     * }
     */
    public static final OfLong datalen$layout() {
        return datalen$LAYOUT;
    }

    private static final long datalen$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t datalen
     * }
     */
    public static final long datalen$offset() {
        return datalen$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t datalen
     * }
     */
    public static long datalen(MemorySegment struct) {
        return struct.get(datalen$LAYOUT, datalen$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t datalen
     * }
     */
    public static void datalen(MemorySegment struct, long fieldValue) {
        struct.set(datalen$LAYOUT, datalen$OFFSET, fieldValue);
    }

    private static final OfLong inflatedlen$LAYOUT = (OfLong)$LAYOUT.select(groupElement("inflatedlen"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t inflatedlen
     * }
     */
    public static final OfLong inflatedlen$layout() {
        return inflatedlen$LAYOUT;
    }

    private static final long inflatedlen$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t inflatedlen
     * }
     */
    public static final long inflatedlen$offset() {
        return inflatedlen$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t inflatedlen
     * }
     */
    public static long inflatedlen(MemorySegment struct) {
        return struct.get(inflatedlen$LAYOUT, inflatedlen$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t inflatedlen
     * }
     */
    public static void inflatedlen(MemorySegment struct, long fieldValue) {
        struct.set(inflatedlen$LAYOUT, inflatedlen$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

