// Generated by jextract

package com.sernamar.jgit2.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct git_submodule_update_options {
 *     unsigned int version;
 *     git_checkout_options checkout_opts;
 *     git_fetch_options fetch_opts;
 *     int allow_fetch;
 * }
 * }
 */
public class git_submodule_update_options {

    git_submodule_update_options() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        git2.C_INT.withName("version"),
        MemoryLayout.paddingLayout(4),
        git_checkout_options.layout().withName("checkout_opts"),
        git_fetch_options.layout().withName("fetch_opts"),
        git2.C_INT.withName("allow_fetch"),
        MemoryLayout.paddingLayout(4)
    ).withName("git_submodule_update_options");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final OfInt version$layout() {
        return version$LAYOUT;
    }

    private static final long version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final long version$offset() {
        return version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static int version(MemorySegment struct) {
        return struct.get(version$LAYOUT, version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static void version(MemorySegment struct, int fieldValue) {
        struct.set(version$LAYOUT, version$OFFSET, fieldValue);
    }

    private static final GroupLayout checkout_opts$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("checkout_opts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_checkout_options checkout_opts
     * }
     */
    public static final GroupLayout checkout_opts$layout() {
        return checkout_opts$LAYOUT;
    }

    private static final long checkout_opts$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_checkout_options checkout_opts
     * }
     */
    public static final long checkout_opts$offset() {
        return checkout_opts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_checkout_options checkout_opts
     * }
     */
    public static MemorySegment checkout_opts(MemorySegment struct) {
        return struct.asSlice(checkout_opts$OFFSET, checkout_opts$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_checkout_options checkout_opts
     * }
     */
    public static void checkout_opts(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, checkout_opts$OFFSET, checkout_opts$LAYOUT.byteSize());
    }

    private static final GroupLayout fetch_opts$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("fetch_opts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * git_fetch_options fetch_opts
     * }
     */
    public static final GroupLayout fetch_opts$layout() {
        return fetch_opts$LAYOUT;
    }

    private static final long fetch_opts$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * git_fetch_options fetch_opts
     * }
     */
    public static final long fetch_opts$offset() {
        return fetch_opts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * git_fetch_options fetch_opts
     * }
     */
    public static MemorySegment fetch_opts(MemorySegment struct) {
        return struct.asSlice(fetch_opts$OFFSET, fetch_opts$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * git_fetch_options fetch_opts
     * }
     */
    public static void fetch_opts(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, fetch_opts$OFFSET, fetch_opts$LAYOUT.byteSize());
    }

    private static final OfInt allow_fetch$LAYOUT = (OfInt)$LAYOUT.select(groupElement("allow_fetch"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int allow_fetch
     * }
     */
    public static final OfInt allow_fetch$layout() {
        return allow_fetch$LAYOUT;
    }

    private static final long allow_fetch$OFFSET = 368;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int allow_fetch
     * }
     */
    public static final long allow_fetch$offset() {
        return allow_fetch$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int allow_fetch
     * }
     */
    public static int allow_fetch(MemorySegment struct) {
        return struct.get(allow_fetch$LAYOUT, allow_fetch$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int allow_fetch
     * }
     */
    public static void allow_fetch(MemorySegment struct, int fieldValue) {
        struct.set(allow_fetch$LAYOUT, allow_fetch$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

